
map = ["трава", "камни", "озеро", "озеро", "песок", "камни", "земля"]

answer = ""
x = 1
while answer.lower() != "стоп":
	print(
		f"Вы находитесь на клетке {x}. Вокруг вас {map[x-1]}. "
		f"Куда вы пойдете: вперед или назад?")
	answer = input()
	if answer.lower() == "вперед":
		if x + 1 > 7:
			print("Вперед дороги нет, поворачивай назад\n")
			continue
		x += 1
	elif answer.lower() == "назад":
		if x - 1 < 1:
			print("Назад дороги нет, поворачивай вперед\n")
			continue
		x -= 1
print("Добро пожаловать домой")